---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaFile
source: html/ddc1e6ec-3e7c-f6d1-5d8c-c251349ad070.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaFile Property

The full name of an IFC schema file.

## Syntax (C#)
```csharp
public string SchemaFile { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null